<template>
	<view class="agreement">
		<rich-text :nodes="nodes"></rich-text>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				nodes: '<div style="text-align: left; line-height: 1.5rem">本协议为您与拾鲤助销平台（即拾鲤，域名为10li01.cn）管理者之间所订立的契约，具有合同的法律效力，请您仔细阅读。<br/>' +
                    '一、本协议内容、生效、变更<br/>' +
                    '1.1本协议内容包括协议正文及所有拾鲤已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何拾鲤及其关联公司提供的服务（以下称为拾鲤平台服务）均受本协议约束。<br/>' +
                    '1.2本协议中，“用户”、“会员”为买方、卖方的统称；可单指买方，注册使用拾鲤营销系统的会员；也可单指卖方，即在拾鲤平台提供商品的供应商或线下商家。<br/>' +
                    '1.3您应当在使用拾鲤平台服务之前认真阅读全部协议内容。如您对协议有任何疑问，应向拾鲤咨询。您在同意所有协议条款并完成注册程序，才能成为拾鲤的正式用户，您点击“我已经阅读并同意遵守《拾鲤用户服务协议》”按钮后，本协议即生效，对双方产生约束力。<br/>' +
                    '1.4只要您使用拾鲤平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得拾鲤对您问询的解答等理由，主张本协议无效，或要求撤销本协议。1.5 您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。<br/>' +
                    '1.6 您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用拾鲤平台服务。<br/>' +
                    '1.7 拾鲤有权根据需要不定期地制订、修改本协议及/或各类规则，并在拾鲤平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用拾鲤平台服务。您继续使用拾鲤平台服务的，即表明您接受修订后的协议和规则。<br/>' +
                    '二、注册<br/>' +
                    '2.1 注册资格 您须具有法定的相应权利能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或其他拾鲤平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。<br/>' +
                    '2.2 注册资料 <br/>' +
                    '2.2.1 您应自行诚信向拾鲤提供注册资料，您承诺所提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新您的注册资料。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您应承担因此引起的相应责任及后果，并且拾鲤保留终止用户使用拾鲤平台各项服务的权利。<br/>' +
                    '2.2.2 您在拾鲤进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。<br/>' +
                    '2.3 账户<br/>' +
                    '2.3.1 您注册成功后，即成为拾鲤平台的会员，将持有拾鲤平台唯一编号的会员名和密码等账户信息，您可以根据本站规定改变您的密码。<br/>' +
                    '2.3.2 您设置的会员名不得侵犯或涉嫌侵犯他人合法权益。否则，拾鲤有权终止向您提供拾鲤平台服务，注销您的账户。账户注销后，相应的会员名将开放给任意用户注册登记使用。<br/>' +
                    '2.3.3 您应谨慎合理的保存、使用您的会员名和密码，应对通过您的会员名和密码实施的行为负责。除非有法律规定或司法裁定，且征得拾鲤的同意，否则，会员名和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。<br/>' +
                    '2.3.4 您不得将在拾鲤注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。<br/>' +
                    '2.3.5 如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知拾鲤，要求拾鲤暂停相关服务，并向公安机关报案。您理解拾鲤对您的请求采取行动需要合理时间，拾鲤对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。<br/>' +
                    '2.3.6 为方便您使用拾鲤平台服务及拾鲤关联公司或其他组织的服务（以下称其他服务），您同意并授权拾鲤将您在注册、使用拾鲤平台服务过程中提供、形成的信息传递给向您提供其他服务的拾鲤关联公司或其他组织，或从提供其他服务的拾鲤关联公司或其他组织获取您在注册、使用其他服务期间提供、形成的信息。<br/>' +
                    '2.4 用户信息的合理使用<br/>' +
                    '2.4.1 您同意，拾鲤平台拥有通过短信、电话、电子邮箱等形式，向在拾鲤注册、购物用户、收货人发送订单信息、新品发布等告知信息的权利。<br/>' +
                    '2.4.2 您了解并同意，拾鲤有权应国家司法、行政等主管部门的要求，向其提供您在拾鲤平台填写的注册信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权，则拾鲤亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。<br/>' +
                    '2.4.3 您同意，拾鲤有权使用您的注册信息、用户名、密码等信息，登陆进入您的注册账户，进行证据保全。<br/>' +
                    '三、拾鲤平台服务规范<br/>' +
                    '3.1 通过拾鲤及其关联公司提供的拾鲤平台服务和其它服务，您可在拾鲤平台上查询商品和服务信息以及使用拾鲤以下服务：3.1.1 标准版用户：（1）拥有自定义积分兑换体系，可对企业的礼品积分兑换进行自定义设置，开展自定义的积分兑换政策；（2）拾鲤平台提供精品B2B内网采购服务，用户可以设置积分兑换礼品的促销使用。3.1.2 尊享版用户：除上述标准版用户服务外，还有（1）用户的客户（简称“消费者”）在平台消费时，每消费一定金额可以获得平台赠送的一定数量的购物券。消费者使用购物券在平台消费的，获得购物券使用额10%补贴。（2）平台具有会员管理功能，用户可自定义独立设置自己的会员管理体系。（3）平台具有预约功能，消费者在用户消费商品或服务时，可根据平台提供的功能进行预约。消费者预约时支付的相关款项由平台代收，消费者到用户处消费后，平台扣除平台及第三方支付平台收取的手续费后将该款项支付给用户。3.2 在拾鲤平台上使用拾鲤服务过程中，您同意严格遵守以下义务：3.2.1 不得传输或发表损害国家、社会公共利益和涉及国家安全的信息资料或言论；<br/>' +
                    '3.2.2 不利用本站从事窃取商业秘密、窃取个人信息等违法犯罪活动；<br/>' +
                    '3.2.3 不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为；<br/>' +
                    '3.2.4 不发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；<br/>' +
                    '3.2.5 不得将拾鲤商品以除拾鲤同意的形式之外的方式出售给第三方；<br/>' +
                    '3.2.6 不对拾鲤平台上的任何数据作商业性利用，包括但不限于在未经拾鲤事先书面同意的情况下，以复制、传播等任何方式使用拾鲤平台上展示的资料。不使用任何装置、软件或程序干预拾鲤平台的正常运营。<br/>' +
                    '3.2.7 本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。<br/>' +
                    '3.2.8 您同意，若您未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号、订单等措施。<br/>' +
                    '3.2.9 经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者拾鲤根据自身的判断，认为您的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则拾鲤有权在本平台上公示您的该等涉嫌违法或违约行为及拾鲤已对您采取的措施。<br/>' +
                    '3.2.10 对于您在拾鲤平台上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，拾鲤有权不经通知您即予以删除，且按照规则的规定进行处罚。<br/>' +
                    '3.2.11 对于您在拾鲤平台上实施的行为，包括您未在拾鲤平台上实施但已经对拾鲤平台及其用户产生影响的行为，拾鲤有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并采取暂停或关闭用户帐号及其他措施。<br/>' +
                    '3.2.12 对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保拾鲤免于因此产生损失或增加费用。<br/>' +
                    '3.2.13 如您涉嫌违反有关法律或者本协议之规定，使拾鲤遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿拾鲤因此造成的损失及（或）发生的费用，包括合理的律师费用。<br/>' +
                    '3.3 除非拾鲤另行声明，拾鲤内的所有产品、技术、软件、程序、数据及其他信息（包括文字、图标、图片、照片、音频、视频、图表、色彩组合、版面设计等，统称商品及商品信息）的所有权利（包括版权、商标权、专利权、商业秘密及其他相关权利）均归拾鲤卖方及/或其关联公司所有。未经拾鲤卖方及/或其关联公司许可，任何人不得以包括通过机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像、上载、下载等方式擅自使用拾鲤内的任何内容。<br/>' +
                    '四、拾鲤商城订单<br/>' +
                    '4.1 在拾鲤平台购物的用户，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸等信息。因平台展示的商品和价格等信息，您下单时须完整填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且拾鲤保留终止用户使用拾鲤平台各项服务的权利。<br/>' +
                    '4.2 系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向平台／供应商／卖方发出的合同要约；商品供应商／卖方收到您的订单信息后，将订单中的商品从仓库实际向您发出时（ 以商品出库为标志）／去线下商家消费时，方视为您与供应商／卖方之间就实际消费的商品建立了合同关系；如果一份订单里订购消费了多种商品并且供应商／商家只给您提供了部分商品时，您与供应商／卖方之间仅就实际向您发出的商品建立了合同关系。<br/>' +
                    '4.3 您了解并同意，拾鲤平台上的商品、价格、数量、是否有货等商品信息随时可能发生变动，本站不作特别通知。由于互联网技术原因导致网页显示信息可能会有一定的滞后性或差错，对此在合同未成立前，您接受本平台在发现网页错误，正式向您发出通知后，对商品信息进行调整，订单按照正确的信息执行，或取消订单。<br/>' +
                    '4.4 拾鲤所服务的客户为以礼品促销为目的的自然人、法人及其他组织，不包括经销商，如发现经销商购物，拾鲤将拒绝为其服务，由此产生的一切后果由经销商自行承担，且拾鲤有权要求经销商支付人民币10万元作为违约金，若拾鲤实际损失超过人民币10万元的则以实际损失为准。<br/>' +
                    '4.5 您了解并同意，如您购买商品，发生缺货，您有权取消订单；本平台无法保证您提交的订单信息中希望购买的商品都会有货。<br/>' +
                    '4.6 拾鲤关联公司或供应商／卖方将会把商品（货物）送到您所指定的收货地址。您了解拾鲤平台所提示的送货时间仅供参考，实际送货会与参考时间略有差异。拾鲤平台管理者和所有者或其关联公司不对因您及收货人原因导致无法送货或延迟送货承担责任。若发生不可抗力或其他正当合理理由导致发货延迟的，您将给予充分理解。<br/>' +
                    '4.7 拾鲤保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。<br/>' +
                    '五、责任范围和责任限制<br/>' +
                    '5.1 您保证已经完全理解拾鲤平台及其商业模式并予以认可。您同时保证，在平台上合法经营，不将拾鲤平台提供的商品或服务用于非法目的，因违法经营所产生的责任由您独自承担，给拾鲤造成财产或名誉损失的愿承担赔偿责任。<br/>' +
                    '5.2 拾鲤平台提供的商品仅限于您向客户作为礼品赠送促销使用。若您存在特殊情况需要销售上述平台采购商品的，必须征得拾鲤平台书面同意，且商品售价不得低于拾鲤平台指定的该商品的市场指导价。因违规销售拾鲤产品所产生的下列责任由您独自承担：<br/>' +
                    '5.2.1 给拾鲤平台及生产厂家造成财产或名誉损失的；<br/>' +
                    '5.2.2 您同意拾鲤有权在自行调查后暂停、冻结或关闭您的账户，停止为您继续服务；<br/>' +
                    '5.2.3 拾鲤及生产厂家保留追究您法律责任的权；<br/>' +
                    '5.2.4 拾鲤有权要求您缴纳相应金额的出场金、赔偿金。<br/>' +
                    '5.3 您成为拾鲤平台用户后，应自觉维护拾鲤形象，您存在任何问题、疑问或意见均应当向拾鲤客服进行反应，由拾鲤进行处理，您不得将拾鲤及平台相关信息泄露给第三方，否则拾鲤有权冻结、暂停或关闭您的账户。<br/>' +
                    '5.4 您成为拾鲤平台用户后，应采取妥善措施保护您的账户及密码，您不得将拾鲤的账户及密码采取包括但不限于出售、转让、出借、使用等方式许可第三方使用，因前述情形造成的损失由您自行承担责任，且拾鲤有权冻结、暂停或关闭您的账户，并保留追究您的法律责任的权利。<br/>' +
                    '5.5 拾鲤平台作为您进行了解、咨询、协商、交易的场所，提示您：应谨慎判断确定相关物品及/或信息的真实性、合法性和有效性。除非另有明确的书面说明，拾鲤不对各商家在拾鲤平台上发布的信息、内容、材料、产品和服务及各方在交易中各项义务的履行能力作任何形式的担保，法律法规另有规定的除外。<br/>' +
                    '5.6 拾鲤在接到您投诉、主管机关通知或按照法律法规规定，有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形时,拾鲤可依约定或依法采取相应措施。5.7 您了解并同意，拾鲤不对因下述任一情况而导致您的任何损害承担赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：<br/>' +
                    '5.7.1 第三方未经批准的使用您的账户或更改您的数据。<br/>' +
                    '5.7.2 您对拾鲤平台服务的误解。<br/>' +
                    '5.7.3 任何非因拾鲤的原因而引起的与拾鲤平台服务有关的其它损失。<br/>' +
                    '5.8 由于法律规定的不可抗力，信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，劳动争议，生产力或生产资料不足，司法行政机关的命令或第三方的不作为及其他本平台无法控制的原因造成的本平台不能服务或延迟服务、丢失数据信息、记录的，拾鲤不承担责任，但拾鲤将协助处理相关事宜。<br/>' +
                    '六、协议终止<br/>' +
                    '6.1 您同意，拾鲤有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部拾鲤平台服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任。<br/>' +
                    '6.2 出现以下情况时，拾鲤有权直接以注销账户的方式终止本协议: <br/>' +
                    '6.2.1 拾鲤终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为拾鲤用户的；<br/>' +
                    '6.2.2 您提供的联系方式已注销，且没有其他方式可以与您进行联系，而您在拾鲤通知后三个工作日内仍未更改为有效的联系方式的。<br/>' +
                    '6.2.3您注册信息中的主要内容不真实或不准确或不及时或不完整。<br/>' +
                    '6.2.4 本协议（含规则）变更时，您明示并通知拾鲤不愿接受新的服务协议的；<br/>' +
                    '6.2.5 其它拾鲤认为应当终止服务的情况。<br/>' +
                    '6.3 您有权向拾鲤要求注销您的账户，经拾鲤审核同意的，拾鲤注销（永久冻结）您的账户，届时，您与拾鲤基于本协议的合同关系即终止。您的账户被注销（永久冻结）后，拾鲤没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。<br/>' +
                    '6.4 您同意，您与拾鲤的合同关系终止后，拾鲤仍享有下列权利： <br/>' +
                    '6.4.1 继续保存您的注册信息及您使用拾鲤平台服务期间的所有交易信息。<br/>' +
                    '6.4.2 您在使用拾鲤平台服务期间存在违法行为或违反本协议和/或规则的行为的，拾鲤仍可依据本协议向您主张权利。<br/>' +
                    '6.5 拾鲤中止或终止向您提供拾鲤平台服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保拾鲤免于因此产生任何损失或承担任何费用： <br/>' +
                    '6.5.1 您在服务中止或终止之前已经上传至拾鲤平台的物品尚未交易的，拾鲤有权在中止或终止服务的同时删除此项物品的相关信息； <br/>' +
                    '6.5.2 您在服务中止或终止之前已经与其他会员达成买卖合同，但合同尚未实际履行的，拾鲤有权删除该买卖合同及其交易物品的相关信息； <br/>' +
                    '6.5.3 您在服务中止或终止之前已经与其他会员达成买卖合同且已部分履行的，拾鲤可以不删除该项交易，但拾鲤有权在中止或终止服务的同时将相关情形通知您的交易对方。<br/>' +
                    '七、法律适用、管辖与其他<br/>' +
                    '7.1 本协议包含了您使用拾鲤平台需遵守的一般性规范，您在使用拾鲤平台时还需遵守适用于该平台的特殊性规范。一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。 <br/>' +
                    '7.2 本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区之有效法律（但不包括其冲突法规则）。 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。 <br/>' +
                    '7.3 因本协议履行过程中，因您使用拾鲤服务产生争议应由拾鲤与您沟通并协商处理。协商不成时，双方均同意以拾鲤平台管理者住所地人民法院为管辖法院诉讼解决。 <br/>' +
                    '7.4 若因本协议发生法律纠纷，您同意司法机关或仲裁机构向您留存在拾鲤平台上的地址（未填写地址或地址不详的，以您户籍地址或法人住所地为准）送达相关法律文书即视为送达；该送达方式适用于诉讼的全部过程（包括但不限于案件的受理、审判、判决及其他法律文书的送达）。 <br/>' +
                    '7.5 本协议的最终解释权归拾鲤及其关联企业。</div>'
			}
		},
		onLoad() {
			
		},
		methods: {
			
		}
	}
</script>

<style lang="scss" scoped>
	.agreement {
		height: 100%;
		padding: 24rpx;
	}
</style>
